cjacker/opensource-toolchain-8051/stc-headers/stc8gxx.h
#define TM2PS (*(unsigned char volatile __xdata *)0xfea2)
#define TM3PS (*(unsigned char volatile __xdata *)0xfea3)
#define TM4PS (*(unsigned char volatile __xdata *)0xfea4)
#define ADCTIM (*(unsigned char volatile __xdata *)0xfea8)
#define T3T4PS (*(unsigned char volatile __xdata *)0xfeac)

/////////////////////////////////////////////////
//FD00H-FDFFH
/////////////////////////////////////////////////

#define P0INTE (*(unsigned char volatile __xdata *)0xfd00)
#define P1INTE (*(unsigned char volatile __xdata *)0xfd01)
#define P2INTE (*(unsigned char volatile __xdata *)0xfd02)
#define P3INTE (*(unsigned char volatile __xdata *)0xfd03)
#define P4INTE (*(unsigned char volatile __xdata *)0xfd04)
#define P5INTE (*(unsigned char volatile __xdata *)0xfd05)
#define P6INTE (*(unsigned char volatile __xdata *)0xfd06)
#define P7INTE (*(unsigned char volatile __xdata *)0xfd07)
#define P0INTF (*(unsigned char volatile __xdata *)0xfd10)
#define P1INTF (*(unsigned char volatile __xdata *)0xfd11)
#define P2INTF (*(unsigned char volatile __xdata *)0xfd12)
#define P3INTF (*(unsigned char volatile __xdata *)0xfd13)
#define P4INTF (*(unsigned char volatile __xdata *)0xfd14)
#define P5INTF (*(unsigned char volatile __xdata *)0xfd15)
#define P6INTF (*(unsigned char volatile __xdata *)0xfd16)
#define P7INTF (*(unsigned char volatile __xdata *)0xfd17)
#define P0IM0 (*(unsigned char volatile __xdata *)0xfd20)
#define P1IM0 (*(unsigned char volatile __xdata *)0xfd21)
#define P2IM0 (*(unsigned char volatile __xdata *)0xfd22)
#define P3IM0 (*(unsigned char volatile __xdata *)0xfd23)
#define P4IM0 (*(unsigned char volatile __xdata *)0xfd24)
#define P5IM0 (*(unsigned char volatile __xdata *)0xfd25)
#define P6IM0 (*(unsigned char volatile __xdata *)0xfd26)
#define P7IM0 (*(unsigned char volatile __xdata *)0xfd27)
#define P0IM1 (*(unsigned char volatile __xdata *)0xfd30)
#define P1IM1 (*(unsigned char volatile __xdata *)0xfd31)
#define P2IM1 (*(unsigned char volatile __xdata *)0xfd32)
#define P3IM1 (*(unsigned char volatile __xdata *)0xfd33)
#define P4IM1 (*(unsigned char volatile __xdata *)0xfd34)
#define P5IM1 (*(unsigned char volatile __xdata *)0xfd35)
#define P6IM1 (*(unsigned char volatile __xdata *)0xfd36)
#define P7IM1 (*(unsigned char volatile __xdata *)0xfd37)
#define P0WKUE (*(unsigned char volatile __xdata *)0xfd40)
#define P1WKUE (*(unsigned char volatile __xdata *)0xfd41)
#define P2WKUE (*(unsigned char volatile __xdata *)0xfd42)
#define P3WKUE (*(unsigned char volatile __xdata *)0xfd43)
#define P4WKUE (*(unsigned char volatile __xdata *)0xfd44)
#define P5WKUE (*(unsigned char volatile __xdata *)0xfd45)
#define P6WKUE (*(unsigned char volatile __xdata *)0xfd46)
#define P7WKUE (*(unsigned char volatile __xdata *)0xfd47)
#define PIN_IP (*(unsigned char volatile __xdata *)0xfd60)
#define PIN_IPH (*(unsigned char volatile __xdata *)0xfd61)

/////////////////////////////////////////////////
//FC00H-FCFFH
/////////////////////////////////////////////////

#define PWM3C (*(unsigned int volatile __xdata *)0xfc00)
#define PWM3CH (*(unsigned char volatile __xdata *)0xfc00)
#define PWM3CL (*(unsigned char volatile __xdata *)0xfc01)
#define PWM3CKS (*(unsigned char volatile __xdata *)0xfc02)
#define PWM3IF (*(unsigned char volatile __xdata *)0xfc05)
#define PWM3FDCR (*(unsigned char volatile __xdata *)0xfc06)
#define PWM30T1 (*(unsigned int volatile __xdata *)0xfc10)
#define PWM30T1H (*(unsigned char volatile __xdata *)0xfc10)
#define PWM30T1L (*(unsigned char volatile __xdata *)0xfc11)
#define PWM30T2 (*(unsigned int volatile __xdata *)0xfc12)
#define PWM30T2H (*(unsigned char volatile __xdata *)0xfc12)
#define PWM30T2L (*(unsigned char volatile __xdata *)0xfc13)
#define PWM30CR (*(unsigned char volatile __xdata *)0xfc14)
#define PWM30HLD (*(unsigned char volatile __xdata *)0xfc15)
#define PWM31T1 (*(unsigned int volatile __xdata *)0xfc18)
#define PWM31T1H (*(unsigned char volatile __xdata *)0xfc18)
#define PWM31T1L (*(unsigned char volatile __xdata *)0xfc19)
#define PWM31T2 (*(unsigned int volatile __xdata *)0xfc1a)
#define PWM31T2H (*(unsigned char volatile __xdata *)0xfc1a)
#define PWM31T2L (*(unsigned char volatile __xdata *)0xfc1b)
#define PWM31CR (*(unsigned char volatile __xdata *)0xfc1c)
#define PWM31HLD (*(unsigned char volatile __xdata *)0xfc1d)
#define PWM32T1 (*(unsigned int volatile __xdata *)0xfc20)
#define PWM32T1H (*(unsigned char volatile __xdata *)0xfc20)
#define PWM32T1L (*(unsigned char volatile __xdata *)0xfc21)
#define PWM32T2 (*(unsigned int volatile __xdata *)0xfc22)
#define PWM32T2H (*(unsigned char volatile __xdata *)0xfc22)
#define PWM32T2L (*(unsigned char volatile __xdata *)0xfc23)
#define PWM32CR (*(unsigned char volatile __xdata *)0xfc24)
#define PWM32HLD (*(unsigned char volatile __xdata *)0xfc25)
#define PWM33T1 (*(unsigned int volatile __xdata *)0xfc28)
#define PWM33T1H (*(unsigned char volatile __xdata *)0xfc28)
#define PWM33T1L (*(unsigned char volatile __xdata *)0xfc29)
#define PWM33T2 (*(unsigned int volatile __xdata *)0xfc2a)
#define PWM33T2H (*(unsigned char volatile __xdata *)0xfc2a)
#define PWM33T2L (*(unsigned char volatile __xdata *)0xfc2b)
#define PWM33CR (*(unsigned char volatile __xdata *)0xfc2c)
#define PWM33HLD (*(unsigned char volatile __xdata *)0xfc2d)
#define PWM34T1 (*(unsigned int volatile __xdata *)0xfc30)
#define PWM34T1H (*(unsigned char volatile __xdata *)0xfc30)
#define PWM34T1L (*(unsigned char volatile __xdata *)0xfc31)
#define PWM34T2 (*(unsigned int volatile __xdata *)0xfc32)
#define PWM34T2H (*(unsigned char volatile __xdata *)0xfc32)
#define PWM34T2L (*(unsigned char volatile __xdata *)0xfc33)
#define PWM34CR (*(unsigned char volatile __xdata *)0xfc34)
#define PWM34HLD (*(unsigned char volatile __xdata *)0xfc35)
#define PWM35T1 (*(unsigned int volatile __xdata *)0xfc38)
#define PWM35T1H (*(unsigned char volatile __xdata *)0xfc38)
#define PWM35T1L (*(unsigned char volatile __xdata *)0xfc39)
#define PWM35T2 (*(unsigned int volatile __xdata *)0xfc3a)
#define PWM35T2H (*(unsigned char volatile __xdata *)0xfc3a)
#define PWM35T2L (*(unsigned char volatile __xdata *)0xfc3b)
#define PWM35CR (*(unsigned char volatile __xdata *)0xfc3c)
#define PWM35HLD (*(unsigned char volatile __xdata *)0xfc3d)
#define PWM36T1 (*(unsigned int volatile __xdata *)0xfc40)
#define PWM36T1H (*(unsigned char volatile __xdata *)0xfc40)
#define PWM36T1L (*(unsigned char volatile __xdata *)0xfc41)
#define PWM36T2 (*(unsigned int volatile __xdata *)0xfc42)
#define PWM36T2H (*(unsigned char volatile __xdata *)0xfc42)
#define PWM36T2L (*(unsigned char volatile __xdata *)0xfc43)
#define PWM36CR (*(unsigned char volatile __xdata *)0xfc44)
#define PWM36HLD (*(unsigned char volatile __xdata *)0xfc45)
#define PWM37T1 (*(unsigned int volatile __xdata *)0xfc48)
#define PWM37T1H (*(unsigned char volatile __xdata *)0xfc48)
#define PWM37T1L (*(unsigned char volatile __xdata *)0xfc49)
#define PWM37T2 (*(unsigned int volatile __xdata *)0xfc4a)
#define PWM37T2H (*(unsigned char volatile __xdata *)0xfc4a)
#define PWM37T2L (*(unsigned char volatile __xdata *)0xfc4b)
#define PWM37CR (*(unsigned char volatile __xdata *)0xfc4c)
#define PWM37HLD (*(unsigned char volatile __xdata *)0xfc4d)
#define PWM4C (*(unsigned int volatile __xdata *)0xfc50)
#define PWM4CH (*(unsigned char volatile __xdata *)0xfc50)
#define PWM4CL (*(unsigned char volatile __xdata *)0xfc51)
#define PWM4CKS (*(unsigned char volatile __xdata *)0xfc52)
#define PWM4TADC (*(unsigned int volatile __xdata *)0xfc53)
#define PWM4TADCH (*(unsigned char volatile __xdata *)0xfc53)
#define PWM4TADCL (*(unsigned char volatile __xdata *)0xfc54)
#define PWM4IF (*(unsigned char volatile __xdata *)0xfc55)
#define PWM4FDCR (*(unsigned char volatile __xdata *)0xfc56)
#define PWM40T1 (*(unsigned int volatile __xdata *)0xfc60)
#define PWM40T1H (*(unsigned char volatile __xdata *)0xfc60)
#define PWM40T1L (*(unsigned char volatile __xdata *)0xfc61)
#define PWM40T2 (*(unsigned int volatile __xdata *)0xfc62)
#define PWM40T2H (*(unsigned char volatile __xdata *)0xfc62)
#define PWM40T2L (*(unsigned char volatile __xdata *)0xfc63)
#define PWM40CR (*(unsigned char volatile __xdata *)0xfc64)
#define PWM40HLD (*(unsigned char volatile __xdata *)0xfc65)
#define PWM41T1 (*(unsigned int volatile __xdata *)0xfc68)
#define PWM41T1H (*(unsigned char volatile __xdata *)0xfc68)
#define PWM41T1L (*(unsigned char volatile __xdata *)0xfc69)
#define PWM41T2 (*(unsigned int volatile __xdata *)0xfc6a)
#define PWM41T2H (*(unsigned char volatile __xdata *)0xfc6a)
#define PWM41T2L (*(unsigned char volatile __xdata *)0xfc6b)
#define PWM41CR (*(unsigned char volatile __xdata *)0xfc6c)
#define PWM41HLD (*(unsigned char volatile __xdata *)0xfc6d)
#define PWM42T1 (*(unsigned int volatile __xdata *)0xfc70)
#define PWM42T1H (*(unsigned char volatile __xdata *)0xfc70)
#define PWM42T1L (*(unsigned char volatile __xdata *)0xfc71)
#define PWM42T2 (*(unsigned int volatile __xdata *)0xfc72)
#define PWM42T2H (*(unsigned char volatile __xdata *)0xfc72)
#define PWM42T2L (*(unsigned char volatile __xdata *)0xfc73)
#define PWM42CR (*(unsigned char volatile __xdata *)0xfc74)
#define PWM42HLD (*(unsigned char volatile __xdata *)0xfc75)
#define PWM43T1 (*(unsigned int volatile __xdata *)0xfc78)
#define PWM43T1H (*(unsigned char volatile __xdata *)0xfc78)
#define PWM43T1L (*(unsigned char volatile __xdata *)0xfc79)
#define PWM43T2 (*(unsigned int volatile __xdata *)0xfc7a)
#define PWM43T2H (*(unsigned char volatile __xdata *)0xfc7a)
#define PWM43T2L (*(unsigned char volatile __xdata *)0xfc7b)
#define PWM43CR (*(unsigned char volatile __xdata *)0xfc7c)
#define PWM43HLD (*(unsigned char volatile __xdata *)0xfc7d)
#define PWM44T1 (*(unsigned int volatile __xdata *)0xfc80)
#define PWM44T1H (*(unsigned char volatile __xdata *)0xfc80)
#define PWM44T1L (*(unsigned char volatile __xdata *)0xfc81)
#define PWM44T2 (*(unsigned int volatile __xdata *)0xfc82)
#define PWM44T2H (*(unsigned char volatile __xdata *)0xfc82)
#define PWM44T2L (*(unsigned char volatile __xdata *)0xfc83)
#define PWM44CR (*(unsigned char volatile __xdata *)0xfc84)
#define PWM44HLD (*(unsigned char volatile __xdata *)0xfc85)
#define PWM45T1 (*(unsigned int volatile __xdata *)0xfc88)
#define PWM45T1H (*(unsigned char volatile __xdata *)0xfc88)
#define PWM45T1L (*(unsigned char volatile __xdata *)0xfc89)
#define PWM45T2 (*(unsigned int volatile __xdata *)0xfc8a)
#define PWM45T2H (*(unsigned char volatile __xdata *)0xfc8a)
#define PWM45T2L (*(unsigned char volatile __xdata *)0xfc8b)
#define PWM45CR (*(unsigned char volatile __xdata *)0xfc8c)
#define PWM45HLD (*(unsigned char volatile __xdata *)0xfc8d)
#define PWM46T1 (*(unsigned int volatile __xdata *)0xfc90)
#define PWM46T1H (*(unsigned char volatile __xdata *)0xfc90)
#define PWM46T1L (*(unsigned char volatile __xdata *)0xfc91)
#define PWM46T2 (*(unsigned int volatile __xdata *)0xfc92)
#define PWM46T2H (*(unsigned char volatile __xdata *)0xfc92)
#define PWM46T2L (*(unsigned char volatile __xdata *)0xfc93)
#define PWM46CR (*(unsigned char volatile __xdata *)0xfc94)
#define PWM46HLD (*(unsigned char volatile __xdata *)0xfc95)
#define PWM47T1 (*(unsigned int volatile __xdata *)0xfc98)
#define PWM47T1H (*(unsigned char volatile __xdata *)0xfc98)
#define PWM47T1L (*(unsigned char volatile __xdata *)0xfc99)
#define PWM47T2 (*(unsigned int volatile __xdata *)0xfc9a)
#define PWM47T2H (*(unsigned char volatile __xdata *)0xfc9a)
#define PWM47T2L (*(unsigned char volatile __xdata *)0xfc9b)
#define PWM47CR (*(unsigned char volatile __xdata *)0xfc9c)
#define PWM47HLD (*(unsigned char volatile __xdata *)0xfc9d)
#define PWM5C (*(unsigned int volatile __xdata *)0xfca0)
#define PWM5CH (*(unsigned char volatile __xdata *)0xfca0)
#define PWM5CL (*(unsigned char volatile __xdata *)0xfca1)
#define PWM5CKS (*(unsigned char volatile __xdata *)0xfca2)
#define PWM5IF (*(unsigned char volatile __xdata *)0xfca5)
#define PWM5FDCR (*(unsigned char volatile __xdata *)0xfca6)
#define PWM50T1 (*(unsigned int volatile __xdata *)0xfcb0)
#define PWM50T1H (*(unsigned char volatile __xdata *)0xfcb0)
#define PWM50T1L (*(unsigned char volatile __xdata *)0xfcb1)
#define PWM50T2 (*(unsigned int volatile __xdata *)0xfcb2)
#define PWM50T2H (*(unsigned char volatile __xdata *)0xfcb2)
#define PWM50T2L (*(unsigned char volatile __xdata *)0xfcb3)
#define PWM50CR (*(unsigned char volatile __xdata *)0xfcb4)
#define PWM50HLD (*(unsigned char volatile __xdata *)0xfcb5)
#define PWM51T1 (*(unsigned int volatile __xdata *)0xfcb8)
#define PWM51T1H (*(unsigned char volatile __xdata *)0xfcb8)
#define PWM51T1L (*(unsigned char volatile __xdata *)0xfcb9)
#define PWM51T2 (*(unsigned int volatile __xdata *)0xfcba)
#define PWM51T2H (*(unsigned char volatile __xdata *)0xfcba)
#define PWM51T2L (*(unsigned char volatile __xdata *)0xfcbb)
#define PWM51CR (*(unsigned char volatile __xdata *)0xfcbc)
#define PWM51HLD (*(unsigned char volatile __xdata *)0xfcbd)
#define PWM52T1 (*(unsigned int volatile __xdata *)0xfcc0)
#define PWM52T1H (*(unsigned char volatile __xdata *)0xfcc0)
#define PWM52T1L (*(unsigned char volatile __xdata *)0xfcc1)
#define PWM52T2 (*(unsigned int volatile __xdata *)0xfcc2)
#define PWM52T2H (*(unsigned char volatile __xdata *)0xfcc2)
#define PWM52T2L (*(unsigned char volatile __xdata *)0xfcc3)
#define PWM52CR (*(unsigned char volatile __xdata *)0xfcc4)
#define PWM52HLD (*(unsigned char volatile __xdata *)0xfcc5)
#define PWM53T1 (*(unsigned int volatile __xdata *)0xfcc8)
#define PWM53T1H (*(unsigned char volatile __xdata *)0xfcc8)
#define PWM53T1L (*(unsigned char volatile __xdata *)0xfcc9)
#define PWM53T2 (*(unsigned int volatile __xdata *)0xfcca)
#define PWM53T2H (*(unsigned char volatile __xdata *)0xfcca)
#define PWM53T2L (*(unsigned char volatile __xdata *)0xfccb)
#define PWM53CR (*(unsigned char volatile __xdata *)0xfccc)
#define PWM53HLD (*(unsigned char volatile __xdata *)0xfccd)
#define PWM54T1 (*(unsigned int volatile __xdata *)0xfcd0)
#define PWM54T1H (*(unsigned char volatile __xdata *)0xfcd0)
#define PWM54T1L (*(unsigned char volatile __xdata *)0xfcd1)
#define PWM54T2 (*(unsigned int volatile __xdata *)0xfcd2)
#define PWM54T2H (*(unsigned char volatile __xdata *)0xfcd2)
#define PWM54T2L (*(unsigned char volatile __xdata *)0xfcd3)
#define PWM54CR (*(unsigned char volatile __xdata *)0xfcd4)
#define PWM54HLD (*(unsigned char volatile __xdata *)0xfcd5)
#define PWM55T1 (*(unsigned int volatile __xdata *)0xfcd8)
#define PWM55T1H (*(unsigned char volatile __xdata *)0xfcd8)
#define PWM55T1L (*(unsigned char volatile __xdata *)0xfcd9)
#define PWM55T2 (*(unsigned int volatile __xdata *)0xfcda)
#define PWM55T2H (*(unsigned char volatile __xdata *)0xfcda)
#define PWM55T2L (*(unsigned char volatile __xdata *)0xfcdb)
#define PWM55CR (*(unsigned char volatile __xdata *)0xfcdc)
#define PWM55HLD (*(unsigned char volatile __xdata *)0xfcdd)
#define PWM56T1 (*(unsigned int volatile __xdata *)0xfce0)
#define PWM56T1H (*(unsigned char volatile __xdata *)0xfce0)
#define PWM56T1L (*(unsigned char volatile __xdata *)0xfce1)
#define PWM56T2 (*(unsigned int volatile __xdata *)0xfce2)
#define PWM56T2H (*(unsigned char volatile __xdata *)0xfce2)
#define PWM56T2L (*(unsigned char volatile __xdata *)0xfce3)
#define PWM56CR (*(unsigned char volatile __xdata *)0xfce4)
#define PWM56HLD (*(unsigned char volatile __xdata *)0xfce5)
#define PWM57T1 (*(unsigned int volatile __xdata *)0xfce8)
#define PWM57T1H (*(unsigned char volatile __xdata *)0xfce8)
#define PWM57T1L (*(unsigned char volatile __xdata *)0xfce9)
#define PWM57T2 (*(unsigned int volatile __xdata *)0xfcea)
#define PWM57T2H (*(unsigned char volatile __xdata *)0xfcea)
#define PWM57T2L (*(unsigned char volatile __xdata *)0xfceb)
#define PWM57CR (*(unsigned char volatile __xdata *)0xfcec)
#define PWM57HLD (*(unsigned char volatile __xdata *)0xfced)

